
#include <stdio.h>
#include <string.h>

int main()
{
	int a = 1;
	char* p = (char*)&a;
	if (*p==1)
	{
		printf("小端\n");
	}
	else
	{
		printf("大端\n");
	}

	char x = -1; 
	//char 8位 11111111
	signed char y = -1;
	//11111111
	unsigned char z = -1;
	//11111111
	printf("%d %d %d\n", x, y, z); 
	//%d 整型提升
	// x 111111111111111111111111111111111111
	// y 111111111111111111111111111111111111
	// z   无符号 00000000000000000000000011111111

	char b = -128;
	//10000000000000000000000010000000
	//11111111111111111111111101111111
	//11111111111111111111111110000000
	//10000000                                           存在char b
	//11111111111111111111111110000000                   存储时就整型提升了
	printf("%u\n", b);                                   //打印时认为无符号所以4294967168
	printf("%d\n", b);                                   //打印时认为有符号所以-128

	char c = 128;
	//00000000000000000000000010000000
	//10000000                                           存在char b
	//补码不同但存到char里一样，整型提升1看成符号位和-128相同
	//11111111111111111111111110000000                   存储时就整型提升了
	printf("%u\n", c);                                   //打印时认为无符号所以4294967168
	printf("%d\n", c);


	char arr[1000] = { 0 };
	int i = 0;
	for ( i = 0; i < 1000; i++)
	{
		arr[i] = -1 - i;               //-1 -2 -3 ....-128 127 126.....3 2 1 0 -1 -2 ....
	}
	printf("%d\n", strlen(arr));        //求字符串长度找\0，找到0，停止  128+127=255      


	int n = 9;                         //以整型存储
	float* pFloat = (float*)&n;
	printf("%d\n", n);
	printf("%f\n", *pFloat);
	
	*pFloat = 9.0;                     //以浮点型存储
	printf("%d\n", n);
	printf("%f\n", *pFloat);


	return 0;
}